ข้อ 1 ให้หาคะแนน เฉลี่ย ของแต่ละคน สร้าง array ว่างก่อนเเละจากนั้นเอา array students มาโดยใช้ foreach ในการรันค่าทั้งของ array มาเก็บไว้ยัง student ที่เป็นตัวเเปรใหม่
เเละกำหนดค่าผลรวม(total) โดยการเรียกใช้ค่า scores เเละใข้ reduce ในการช่วยคำนวนค่า total โดยการนำค่า score + score อีกตัวเเละไปเก็บที่ sum บวกกันจนครบเเละเก็บค่า
ไว้ที่ total เเละสร้าง avg โดยการเอา total มาหารกับความยาว array ของ student.scores เเละ push ค่าเข้าไป medium เเละreturn medium ออกมาเเละ console.log ดู

ข้อ 2 หาค่าเฉลี่ย, ค่าสูงสุด, ค่าต่ำสุด สร้างเป็น 3 function โดยอันเเรก max ก็ใช้ math.max เลย เเละ return ค่าออกมา min ก็เหมือนกัน ส่วนหาค่าเฉลี่ยใช้ reduce ในการรวมค่าทั้งหมด
เเละนำมาหาค่าเฉลี่ยโดยเอามาหารกับความยาวของ array return ค่าออกมา

ข้อ 3 หาหนังที่มี rating >= 8 เลือกใช้ filter หา rating มากกว่าหรือเท่ากับ เเละใช้ map เอาเเค่ชื่อหนัง